{
    "metadata": {
        "total_size": 2214811648
    },
    "weight_map": {
        "language_model.lm_head.weight": "model.safetensors",
        "language_model.model.embed_tokens.weight": "model.safetensors",
        "language_model.model.layers.0.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.0.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.0.mlp.gate_up_proj.weight": "model.safetensors",
        "language_model.model.layers.0.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.0.post_mlp_layernorm.weight": "model.safetensors",
        "language_model.model.layers.0.post_self_attn_layernorm.weight": "model.safetensors",
        "language_model.model.layers.0.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.0.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.0.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.0.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.1.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.1.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.1.mlp.gate_up_proj.weight": "model.safetensors",
        "language_model.model.layers.1.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.1.post_mlp_layernorm.weight": "model.safetensors",
        "language_model.model.layers.1.post_self_attn_layernorm.weight": "model.safetensors",
        "language_model.model.layers.1.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.1.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.1.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.1.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.10.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.10.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.10.mlp.gate_up_proj.weight": "model.safetensors",
        "language_model.model.layers.10.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.10.post_mlp_layernorm.weight": "model.safetensors",
        "language_model.model.layers.10.post_self_attn_layernorm.weight": "model.safetensors",
        "language_model.model.layers.10.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.10.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.10.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.10.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.11.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.11.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.11.mlp.gate_up_proj.weight": "model.safetensors",
        "language_model.model.layers.11.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.11.post_mlp_layernorm.weight": "model.safetensors",
        "language_model.model.layers.11.post_self_attn_layernorm.weight": "model.safetensors",
        "language_model.model.layers.11.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.11.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.11.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.11.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.12.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.12.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.12.mlp.gate_up_proj.weight": "model.safetensors",
        "language_model.model.layers.12.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.12.post_mlp_layernorm.weight": "model.safetensors",
        "language_model.model.layers.12.post_self_attn_layernorm.weight": "model.safetensors",
        "language_model.model.layers.12.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.12.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.12.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.12.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.13.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.13.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.13.mlp.gate_up_proj.weight": "model.safetensors",
        "language_model.model.layers.13.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.13.post_mlp_layernorm.weight": "model.safetensors",
        "language_model.model.layers.13.post_self_attn_layernorm.weight": "model.safetensors",
        "language_model.model.layers.13.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.13.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.13.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.13.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.14.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.14.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.14.mlp.gate_up_proj.weight": "model.safetensors",
        "language_model.model.layers.14.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.14.post_mlp_layernorm.weight": "model.safetensors",
        "language_model.model.layers.14.post_self_attn_layernorm.weight": "model.safetensors",
        "language_model.model.layers.14.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.14.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.14.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.14.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.15.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.15.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.15.mlp.gate_up_proj.weight": "model.safetensors",
        "language_model.model.layers.15.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.15.post_mlp_layernorm.weight": "model.safetensors",
        "language_model.model.layers.15.post_self_attn_layernorm.weight": "model.safetensors",
        "language_model.model.layers.15.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.15.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.15.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.15.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.2.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.2.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.2.mlp.gate_up_proj.weight": "model.safetensors",
        "language_model.model.layers.2.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.2.post_mlp_layernorm.weight": "model.safetensors",
        "language_model.model.layers.2.post_self_attn_layernorm.weight": "model.safetensors",
        "language_model.model.layers.2.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.2.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.2.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.2.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.3.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.3.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.3.mlp.gate_up_proj.weight": "model.safetensors",
        "language_model.model.layers.3.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.3.post_mlp_layernorm.weight": "model.safetensors",
        "language_model.model.layers.3.post_self_attn_layernorm.weight": "model.safetensors",
        "language_model.model.layers.3.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.3.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.3.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.3.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.4.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.4.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.4.mlp.gate_up_proj.weight": "model.safetensors",
        "language_model.model.layers.4.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.4.post_mlp_layernorm.weight": "model.safetensors",
        "language_model.model.layers.4.post_self_attn_layernorm.weight": "model.safetensors",
        "language_model.model.layers.4.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.4.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.4.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.4.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.5.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.5.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.5.mlp.gate_up_proj.weight": "model.safetensors",
        "language_model.model.layers.5.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.5.post_mlp_layernorm.weight": "model.safetensors",
        "language_model.model.layers.5.post_self_attn_layernorm.weight": "model.safetensors",
        "language_model.model.layers.5.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.5.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.5.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.5.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.6.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.6.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.6.mlp.gate_up_proj.weight": "model.safetensors",
        "language_model.model.layers.6.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.6.post_mlp_layernorm.weight": "model.safetensors",
        "language_model.model.layers.6.post_self_attn_layernorm.weight": "model.safetensors",
        "language_model.model.layers.6.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.6.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.6.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.6.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.7.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.7.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.7.mlp.gate_up_proj.weight": "model.safetensors",
        "language_model.model.layers.7.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.7.post_mlp_layernorm.weight": "model.safetensors",
        "language_model.model.layers.7.post_self_attn_layernorm.weight": "model.safetensors",
        "language_model.model.layers.7.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.7.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.7.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.7.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.8.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.8.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.8.mlp.gate_up_proj.weight": "model.safetensors",
        "language_model.model.layers.8.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.8.post_mlp_layernorm.weight": "model.safetensors",
        "language_model.model.layers.8.post_self_attn_layernorm.weight": "model.safetensors",
        "language_model.model.layers.8.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.8.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.8.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.8.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.layers.9.input_layernorm.weight": "model.safetensors",
        "language_model.model.layers.9.mlp.down_proj.weight": "model.safetensors",
        "language_model.model.layers.9.mlp.gate_up_proj.weight": "model.safetensors",
        "language_model.model.layers.9.post_attention_layernorm.weight": "model.safetensors",
        "language_model.model.layers.9.post_mlp_layernorm.weight": "model.safetensors",
        "language_model.model.layers.9.post_self_attn_layernorm.weight": "model.safetensors",
        "language_model.model.layers.9.self_attn.k_proj.weight": "model.safetensors",
        "language_model.model.layers.9.self_attn.o_proj.weight": "model.safetensors",
        "language_model.model.layers.9.self_attn.q_proj.weight": "model.safetensors",
        "language_model.model.layers.9.self_attn.v_proj.weight": "model.safetensors",
        "language_model.model.norm.weight": "model.safetensors",
        "vision_tower.blocks.0.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.0.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.0.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.0.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.0.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.0.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.0.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.0.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.0.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.0.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.0.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.0.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.0.norm1.weight": "model.safetensors",
        "vision_tower.blocks.0.norm2.weight": "model.safetensors",
        "vision_tower.blocks.1.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.1.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.1.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.1.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.1.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.1.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.1.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.1.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.1.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.1.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.1.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.1.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.1.norm1.weight": "model.safetensors",
        "vision_tower.blocks.1.norm2.weight": "model.safetensors",
        "vision_tower.blocks.10.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.10.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.10.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.10.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.10.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.10.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.10.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.10.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.10.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.10.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.10.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.10.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.10.norm1.weight": "model.safetensors",
        "vision_tower.blocks.10.norm2.weight": "model.safetensors",
        "vision_tower.blocks.11.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.11.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.11.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.11.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.11.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.11.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.11.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.11.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.11.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.11.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.11.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.11.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.11.norm1.weight": "model.safetensors",
        "vision_tower.blocks.11.norm2.weight": "model.safetensors",
        "vision_tower.blocks.12.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.12.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.12.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.12.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.12.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.12.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.12.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.12.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.12.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.12.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.12.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.12.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.12.norm1.weight": "model.safetensors",
        "vision_tower.blocks.12.norm2.weight": "model.safetensors",
        "vision_tower.blocks.13.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.13.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.13.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.13.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.13.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.13.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.13.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.13.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.13.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.13.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.13.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.13.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.13.norm1.weight": "model.safetensors",
        "vision_tower.blocks.13.norm2.weight": "model.safetensors",
        "vision_tower.blocks.14.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.14.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.14.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.14.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.14.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.14.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.14.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.14.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.14.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.14.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.14.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.14.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.14.norm1.weight": "model.safetensors",
        "vision_tower.blocks.14.norm2.weight": "model.safetensors",
        "vision_tower.blocks.15.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.15.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.15.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.15.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.15.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.15.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.15.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.15.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.15.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.15.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.15.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.15.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.15.norm1.weight": "model.safetensors",
        "vision_tower.blocks.15.norm2.weight": "model.safetensors",
        "vision_tower.blocks.16.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.16.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.16.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.16.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.16.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.16.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.16.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.16.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.16.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.16.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.16.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.16.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.16.norm1.weight": "model.safetensors",
        "vision_tower.blocks.16.norm2.weight": "model.safetensors",
        "vision_tower.blocks.17.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.17.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.17.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.17.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.17.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.17.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.17.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.17.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.17.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.17.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.17.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.17.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.17.norm1.weight": "model.safetensors",
        "vision_tower.blocks.17.norm2.weight": "model.safetensors",
        "vision_tower.blocks.18.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.18.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.18.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.18.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.18.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.18.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.18.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.18.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.18.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.18.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.18.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.18.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.18.norm1.weight": "model.safetensors",
        "vision_tower.blocks.18.norm2.weight": "model.safetensors",
        "vision_tower.blocks.19.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.19.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.19.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.19.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.19.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.19.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.19.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.19.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.19.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.19.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.19.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.19.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.19.norm1.weight": "model.safetensors",
        "vision_tower.blocks.19.norm2.weight": "model.safetensors",
        "vision_tower.blocks.2.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.2.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.2.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.2.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.2.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.2.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.2.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.2.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.2.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.2.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.2.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.2.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.2.norm1.weight": "model.safetensors",
        "vision_tower.blocks.2.norm2.weight": "model.safetensors",
        "vision_tower.blocks.20.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.20.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.20.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.20.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.20.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.20.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.20.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.20.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.20.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.20.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.20.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.20.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.20.norm1.weight": "model.safetensors",
        "vision_tower.blocks.20.norm2.weight": "model.safetensors",
        "vision_tower.blocks.21.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.21.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.21.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.21.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.21.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.21.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.21.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.21.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.21.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.21.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.21.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.21.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.21.norm1.weight": "model.safetensors",
        "vision_tower.blocks.21.norm2.weight": "model.safetensors",
        "vision_tower.blocks.22.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.22.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.22.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.22.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.22.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.22.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.22.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.22.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.22.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.22.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.22.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.22.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.22.norm1.weight": "model.safetensors",
        "vision_tower.blocks.22.norm2.weight": "model.safetensors",
        "vision_tower.blocks.23.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.23.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.23.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.23.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.23.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.23.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.23.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.23.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.23.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.23.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.23.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.23.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.23.norm1.weight": "model.safetensors",
        "vision_tower.blocks.23.norm2.weight": "model.safetensors",
        "vision_tower.blocks.3.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.3.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.3.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.3.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.3.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.3.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.3.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.3.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.3.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.3.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.3.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.3.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.3.norm1.weight": "model.safetensors",
        "vision_tower.blocks.3.norm2.weight": "model.safetensors",
        "vision_tower.blocks.4.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.4.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.4.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.4.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.4.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.4.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.4.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.4.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.4.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.4.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.4.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.4.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.4.norm1.weight": "model.safetensors",
        "vision_tower.blocks.4.norm2.weight": "model.safetensors",
        "vision_tower.blocks.5.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.5.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.5.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.5.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.5.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.5.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.5.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.5.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.5.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.5.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.5.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.5.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.5.norm1.weight": "model.safetensors",
        "vision_tower.blocks.5.norm2.weight": "model.safetensors",
        "vision_tower.blocks.6.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.6.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.6.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.6.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.6.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.6.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.6.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.6.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.6.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.6.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.6.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.6.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.6.norm1.weight": "model.safetensors",
        "vision_tower.blocks.6.norm2.weight": "model.safetensors",
        "vision_tower.blocks.7.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.7.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.7.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.7.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.7.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.7.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.7.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.7.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.7.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.7.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.7.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.7.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.7.norm1.weight": "model.safetensors",
        "vision_tower.blocks.7.norm2.weight": "model.safetensors",
        "vision_tower.blocks.8.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.8.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.8.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.8.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.8.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.8.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.8.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.8.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.8.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.8.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.8.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.8.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.8.norm1.weight": "model.safetensors",
        "vision_tower.blocks.8.norm2.weight": "model.safetensors",
        "vision_tower.blocks.9.attn.k_norm.weight": "model.safetensors",
        "vision_tower.blocks.9.attn.proj.bias": "model.safetensors",
        "vision_tower.blocks.9.attn.proj.weight": "model.safetensors",
        "vision_tower.blocks.9.attn.q_norm.weight": "model.safetensors",
        "vision_tower.blocks.9.attn.qkv.bias": "model.safetensors",
        "vision_tower.blocks.9.attn.qkv.weight": "model.safetensors",
        "vision_tower.blocks.9.mlp.down_proj.bias": "model.safetensors",
        "vision_tower.blocks.9.mlp.down_proj.weight": "model.safetensors",
        "vision_tower.blocks.9.mlp.gate_proj.bias": "model.safetensors",
        "vision_tower.blocks.9.mlp.gate_proj.weight": "model.safetensors",
        "vision_tower.blocks.9.mlp.up_proj.bias": "model.safetensors",
        "vision_tower.blocks.9.mlp.up_proj.weight": "model.safetensors",
        "vision_tower.blocks.9.norm1.weight": "model.safetensors",
        "vision_tower.blocks.9.norm2.weight": "model.safetensors",
        "vision_tower.downsample.bias": "model.safetensors",
        "vision_tower.downsample.weight": "model.safetensors",
        "vision_tower.merger.down_proj.weight": "model.safetensors",
        "vision_tower.merger.gate_proj.weight": "model.safetensors",
        "vision_tower.merger.post_projection_norm.bias": "model.safetensors",
        "vision_tower.merger.post_projection_norm.weight": "model.safetensors",
        "vision_tower.merger.proj.weight": "model.safetensors",
        "vision_tower.merger.up_proj.weight": "model.safetensors",
        "vision_tower.patch_embed.proj.bias": "model.safetensors",
        "vision_tower.patch_embed.proj.weight": "model.safetensors",
        "vision_tower.post_layernorm.weight": "model.safetensors"
    }
}